#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.layer_zip: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=8a42fc87503ed542a35cbade99b4bf8f3c5d0a79]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::127449185323:policy/lambda-tf-pattern-ddb-post]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_sns_topic.api_requests_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:APIRequestsNotificationTopic]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_cloudwatch_metric_alarm.budget_alarm: Refreshing state... [id=MonthlyChargeAlarm]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]
aws_cloudwatch_metric_alarm.api_requests_alarm: Refreshing state... [id=APIGatewayRequestAlarm]
aws_sns_topic_subscription.email_alerts["budget_notification"]: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6f3fabe9-6dc6-45dd-a089-9612e2e90a9d]
aws_sns_topic_subscription.email_alerts["api_requests_notification"]: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:APIRequestsNotificationTopic:390d0bd4-c80d-43a4-83c1-affd7a6d4a30]
data.archive_file.layer_zip: Read complete after 1s [id=f8fd81c56eb38b97ad8e424fdd00c8cacf381718]
aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:107]
aws_s3_bucket_ownership_controls.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_s3_object.this: Refreshing state... [id=src.zip]
aws_s3_bucket_acl.private_bucket: Refreshing state... [id=pastebin20231223003519593600000001,private]
aws_lambda_function.apigw_lambda_ddb: Refreshing state... [id=pastebin-sZHL]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.apigw_lambda: Refreshing state... [id=v3fnxm6]
aws_apigatewayv2_route.write["POST /paste"]: Refreshing state... [id=arq6oei]
aws_apigatewayv2_route.write["POST /paste/api"]: Refreshing state... [id=eicvmug]
aws_apigatewayv2_route.read["GET /paste"]: Refreshing state... [id=pd3pcd6]
aws_apigatewayv2_route.read["GET /paste/api"]: Refreshing state... [id=95ed56b]
aws_apigatewayv2_route.read["OPTIONS /paste"]: Refreshing state... [id=1y3pfqk]
aws_apigatewayv2_route.read["GET /paste/api/pastes"]: Refreshing state... [id=i7knacg]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:107" -> (known after apply)
      ~ code_sha256                 = "CTVb2fpVL35uLJrNBvJ2PyG4q6OJGVmfILc+nR0K7+0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-22T15:59:25.598+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:107" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "d6a78aa10261c233a2f457158a3703d580a0d2f6" -> "f8fd81c56eb38b97ad8e424fdd00c8cacf381718" # forces replacement
      ~ source_code_size            = 18538595 -> (known after apply)
      ~ version                     = "107" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.email_alerts["api_requests_notification"] must be replaced
-/+ resource "aws_sns_topic_subscription" "email_alerts" {
      ~ arn                             = "arn:aws:sns:ca-central-1:127449185323:APIRequestsNotificationTopic:390d0bd4-c80d-43a4-83c1-affd7a6d4a30" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = (sensitive value) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:127449185323:APIRequestsNotificationTopic:390d0bd4-c80d-43a4-83c1-affd7a6d4a30" -> (known after apply)
      ~ owner_id                        = "127449185323" -> (known after apply)
      ~ pending_confirmation            = true -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.email_alerts["budget_notification"] must be replaced
-/+ resource "aws_sns_topic_subscription" "email_alerts" {
      ~ arn                             = "arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6f3fabe9-6dc6-45dd-a089-9612e2e90a9d" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = (sensitive value) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6f3fabe9-6dc6-45dd-a089-9612e2e90a9d" -> (known after apply)
      ~ owner_id                        = "127449185323" -> (known after apply)
      ~ pending_confirmation            = true -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*